import numpy as np

class topology_info:
    def __init__(self):
        self.link_capacity_matrix = 10*np.array([
            [0, 10, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0],
            [10, 0, 10, 0, 0, 10, 0, 0, 10, 0, 0, 0],
            [0, 10, 0, 10, 0, 0, 10, 0, 0, 0, 0, 0],
            [0, 0, 10, 0, 0, 0, 0, 10, 0, 0, 0, 0],
            [10, 0, 0, 0, 0, 10, 0, 0, 10, 0, 0, 0],
            [0, 10, 0, 0, 10, 0, 10, 0, 0, 10, 0, 0],
            [0, 0, 10, 0, 0, 10, 0, 10, 0, 0, 10, 0],
            [0, 0, 0, 10, 0, 0, 10, 0, 0, 0, 0, 10],
            [0, 0, 0, 0, 10, 0, 0, 0, 0, 10, 0, 0],
            [0, 0, 0, 0, 0, 10, 0, 0, 10, 0, 10, 0],
            [0, 0, 0, 0, 0, 0, 10, 0, 0, 10, 0, 10],
            [0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 10, 0]
        ])
        self.hop_distance_matrix = np.array([
            [0, 10, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0],
            [10, 0, 10, 0, 0, 10, 0, 0, 10, 0, 0, 0],
            [0, 10, 0, 10, 0, 0, 10, 0, 0, 0, 0, 0],
            [0, 0, 10, 0, 0, 0, 0, 10, 0, 0, 0, 0],
            [10, 0, 0, 0, 0, 10, 0, 0, 10, 0, 0, 0],
            [0, 10, 0, 0, 10, 0, 10, 0, 0, 10, 0, 0],
            [0, 0, 10, 0, 0, 10, 0, 10, 0, 0, 10, 0],
            [0, 0, 0, 10, 0, 0, 10, 0, 0, 0, 0, 10],
            [0, 0, 0, 0, 10, 0, 0, 0, 0, 10, 0, 0],
            [0, 0, 0, 0, 0, 10, 0, 0, 10, 0, 10, 0],
            [0, 0, 0, 0, 0, 0, 10, 0, 0, 10, 0, 10],
            [0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 10, 0]
        ])
        assert self.link_capacity_matrix.shape[0] == self.link_capacity_matrix.shape[1]
        assert self.link_capacity_matrix.shape == self.hop_distance_matrix.shape
        self.nodes_num = self.link_capacity_matrix.shape[0]
        self.max_node_buffer = np.ones((self.nodes_num)) * 2000 # 每个节点的最大缓冲区大小
        self.max_qm_capacity = np.ones((self.nodes_num)) * 100000 # 每个节点的量子存储容量